src/cf/Catalogs/уатТарифыЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатТарифыЗП</Name>
			<Comment>Тарифы зарплаты сотрудников</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппировкаТарифа1</Name>
					<Comment>Группировка тарифа 1</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппировкиТарифов</v8:Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаТарифа2</Name>
					<Comment>Группировка тарифа 2</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппировкиТарифов</v8:Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаТарифа3</Name>
					<Comment>Группировка тарифа 3</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппировкиТарифов</v8:Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Comment>Вид начисления</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатУдержания</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложныйТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Comment>Размер тарифа в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПоСтрокам</Name>
					<Comment>Расчет начислений отдельно по строкам Задания путевого листа, либо по итогам </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникВыручки</Name>
					<Comment>0 - Заказы на ТС, 1 - Маршрутный лист</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Применение</Name>
					<Comment>0 - Путевые листы, 1 - Маршрутные листы, 2 - Ремонтные листы, 3 - Премия, 4 - Удержание, 5 - Заказы такси</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетОтСуммыБезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетБезУчетаСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппировки1</Name>
							<Comment>Знак группировки 1</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.уатЗнакиСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппировки2</Name>
							<Comment>Знак группировки 2</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.уатЗнакиСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппировки3</Name>
							<Comment>Знак группировки 3</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.уатЗнакиСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеГруппировки1</Name>
							<Comment>Значение группировки 1</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеГруппировки2</Name>
							<Comment>Значение группировки 2</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеГруппировки3</Name>
							<Comment>Значение группировки 3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Comment>Размер тарифа в валюте управленческого учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбластиДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбластиДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВидыОбластейДействияТарифовТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОбластиДействия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.уатВидыОбластейДействияТарифа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатВидыОбластейДействияТарифовТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОбластейДействияТарифовТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидПростоя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРемонта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидУпаковки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГеозонаНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГеозонаОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрузовоеМесто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассВодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодельПрицепа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодельТягача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправлениеПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипКонтейнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипПрицепа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипТягача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тягач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассПрицепа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассТягача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатСпособыРасчетаОплатыТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСпособыРасчетаОплатыТруда</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СдельныйЗаработок</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомОтВыручки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомОтВидовНачислений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнойСуммой</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаНочныеЧасы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаПраздничныеИВыходные</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатТарифыЗП/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция СписокДоступныхВидовОбластиДействия(ВидНачисления, РасчетПоСтрокам, Применение, ПараметрВыработки = Неопределено) Экспорт
	Рез = Новый СписокЗначений;
	
	Если Применение = 5 Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Тягач, НСтр("en = 'Vehicle'; ru = 'ТС'"));   
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.КлассТягача, НСтр("en='Vehicle class';ru='Класс ТС'"));
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.МодельТягача, НСтр("en='Vehicle model';ru='Модель ТС'"));
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ТипТягача, НСтр("en='Vehicle type';ru='Тип ТС'"));
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ФормаОплаты);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ИсточникЗаказа);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктОтправления);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктНазначения);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаОтправления);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаНазначения);
	Иначе
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Тягач, НСтр("en='Vehicle';ru='ТС (тягач) / прицеп'")); 
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.КлассТягача, НСтр("en='Vehicle class';ru='Класс ТС (тягача) / прицепа'"));
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.МодельТягача, НСтр("en='Vehicle model';ru='Модель ТС (тягача) / прицепа'"));
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ТипТягача, НСтр("en='Vehicle type';ru='Тип ТС (тягача) / прицепа'"));
	КонецЕсли;
	
	Если ВидНачисления = ПланыВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидРемонта);
		
	ИначеЕсли ВидНачисления <> Неопределено И ВидНачисления.СпособРасчетаОплатыТруда = Перечисления.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки Тогда 
		Если Применение = 5 Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Контрагент);
		Иначе
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Маршрут);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Контрагент);
			
			Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
				Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства);
				Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидПеревозки);
				Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.НаправлениеПеревозки);
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли РасчетПоСтрокам ИЛИ Применение = 1 Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Маршрут);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Контрагент);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Подразделение);
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидПеревозки);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.НаправлениеПеревозки);
		КонецЕсли;
		
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктОтправления);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктНазначения);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Номенклатура);
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаОтправления);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаНазначения);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидГруза);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГрузовоеМесто);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Применение = 0 И ВидНачисления = ПланыВидовРасчета.уатОсновныеНачисления.СдельнаяОплата 
		И ПараметрВыработки = Справочники.уатПараметрыВыработки.ВремяВПростое Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидПростоя);
	КонецЕсли;
	
	Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.КлассВодителя);
	
	Возврат Рез;
КонецФункции

#КонецОбласти
